anachrocomputer/STM32_MCP4822/ArmDds.c
void drawSegG(const int x, const int style, const uint16_t c)
{
   switch (style) {
   case PANAPLEX_STYLE:
      setHline(x, x + WD, GY, c);
      setHline(x, x + WD, GY + 1, c);
      break;
   case LED_DOT_STYLE:
      drawLed(x, 1, 3, c);
      drawLed(x, 2, 3, c);
      break;
   case LED_BAR_STYLE:
      setHline(x + 3, x + WD - 3, 15, c);
      setHline(x + 3, x + WD - 3, 16, c);
      setHline(x + 3, x + WD - 3, 17, c);
      break;
   case VFD_STYLE:
      setHline(x + 2, x + WD - 2, 15, c);
      setHline(x + 1, x + WD - 1, 16, c);
      setHline(x + 2, x + WD - 2, 17, c);
      break;
   }
}


void drawSegH(const int x, const int style, const uint16_t c)
{
   switch (style) {
   case PANAPLEX_STYLE:
      setHline(x + WD, x + WD + 3, GY, c);
      setHline(x + WD, x + WD + 3, GY + 1, c);
      break;
   case LED_DOT_STYLE:
      drawLed(x, 4, 3, c);
      break;
   case LED_BAR_STYLE:
      setHline(x + WD + 1, x + WD + 3, 15, c);
      setHline(x + WD + 1, x + WD + 3, 16, c);
      setHline(x + WD + 1, x + WD + 3, 17, c);
      break;
   case VFD_STYLE:
      setHline(x + WD,     x + WD + 3, 15, c);
      setHline(x + WD - 1, x + WD + 3, 16, c);
      setHline(x + WD,     x + WD + 3, 17, c);
      break;
   }
}


void drawSegI(const int x, const int style, const uint16_t c)
{
   switch (style) {
   case LED_DOT_STYLE:
      drawLed(x, 0, 0, c);
      break;
   }
}


void drawSegJ(const int x, const int style, const uint16_t c)
{
   switch (style) {
   case LED_DOT_STYLE:
      drawLed(x, 3, 0, c);
      break;
   }
}


void drawSegK(const int x, const int style, const uint16_t c)
{
   switch (style) {
   case LED_DOT_STYLE:
      drawLed(x, 3, 3, c);
      break;
   }
}


void drawSegL(const int x, const int style, const uint16_t c)
{
   switch (style) {
   case LED_DOT_STYLE:
      drawLed(x, 3, 6, c);
      break;
   }
}


void drawSegM(const int x, const int style, const uint16_t c)
{
   switch (style) {
   case LED_DOT_STYLE:
      drawLed(x, 0, 6, c);
      break;
   }
}


void drawSegN(const int x, const int style, const uint16_t c)
{
   switch (style) {
   case LED_DOT_STYLE:
      drawLed(x, 0, 3, c);
      break;
   }
}


void drawSegDP(const int x, const int style, const uint16_t c)
{
   switch (style) {
   case PANAPLEX_STYLE:
      setHline(x + WD + 2, x + WD + 4, 29, c);
      setHline(x + WD + 2, x + WD + 4, 30, c);
      setHline(x + WD + 2, x + WD + 4, 31, c);
      break;
   case LED_DOT_STYLE:
      drawLed(x, 4, 6, c);
      break;
   case LED_BAR_STYLE:
   case VFD_STYLE:
      setHline(x + WD + 2, x + WD + 4, 29, c);
      setHline(x + WD + 2, x + WD + 4, 30, c);
      setHline(x + WD + 2, x + WD + 4, 31, c);
      break;
   }
}


void drawSegCN(const int x, const int style, const uint16_t c)
{
   switch (style) {
   case PANAPLEX_STYLE:
      setHline(x + WD + 2, x + WD + 3,  9, c);
      setHline(x + WD + 2, x + WD + 3, 10, c);
      setHline(x + WD + 2, x + WD + 3, 17, c);
      setHline(x + WD + 2, x + WD + 3, 18, c);
      break;
   case LED_DOT_STYLE:
      drawLed(x, 4, 2, c);
      drawLed(x, 4, 4, c);
      break;
   case LED_BAR_STYLE:
   case VFD_STYLE:
      setHline(x + WD + 2, x + WD + 4, 11, c);
      setHline(x + WD + 2, x + WD + 4, 12, c);
      setHline(x + WD + 2, x + WD + 4, 13, c);
      setHline(x + WD + 2, x + WD + 4, 19, c);
      setHline(x + WD + 2, x + WD + 4, 20, c);
      setHline(x + WD + 2, x + WD + 4, 21, c);
      break;
   }
}


/* renderHexDigit --- draw a single digit into the frame buffer in a given style */

void renderHexDigit(const int x, const int digit, const int style, const uint16_t c)
{
   if (0) {
      ;
   }
   else {
      switch (digit) {
      case 0:
         drawSegA(x, style, c);
         drawSegB(x, style, c);
         drawSegC(x, style, c);
         drawSegD(x, style, c);
         drawSegE(x, style, c);
         drawSegF(x, style, c);
         drawSegK(x, style, c);
         drawSegN(x, style, c);
         break;
      case 1:
         drawSegB(x, style, c);
         drawSegC(x, style, c);
         drawSegJ(x, style, c);
         drawSegK(x, style, c);
         drawSegL(x, style, c);
         break;
      case 2:
         drawSegA(x, style, c);
         drawSegB(x, style, c);
         drawSegD(x, style, c);
         drawSegE(x, style, c);
         drawSegG(x, style, c);
         drawSegI(x, style, c);
         drawSegL(x, style, c);
         drawSegM(x, style, c);
         break;
      case 3:
         drawSegA(x, style, c);
         drawSegB(x, style, c);
         drawSegC(x, style, c);
         drawSegD(x, style, c);
         drawSegG(x, style, c);
         drawSegI(x, style, c);
         drawSegM(x, style, c);
         break;
      case 4:
         drawSegB(x, style, c);
         drawSegC(x, style, c);
         drawSegF(x, style, c);
         drawSegG(x, style, c);
         drawSegH(x, style, c);  // Special segment just for 4
         drawSegI(x, style, c);
         drawSegJ(x, style, c);
         drawSegK(x, style, c);
         drawSegL(x, style, c);
         break;
      case 5:
         drawSegA(x, style, c);
         drawSegC(x, style, c);
         drawSegD(x, style, c);
         drawSegF(x, style, c);
         drawSegG(x, style, c);
         drawSegI(x, style, c);
         drawSegJ(x, style, c);
         drawSegM(x, style, c);
         break;
      case 6:
         drawSegA(x, style, c);
         drawSegC(x, style, c);
         drawSegD(x, style, c);
         drawSegE(x, style, c);
         drawSegF(x, style, c);
         drawSegG(x, style, c);
         drawSegJ(x, style, c);
         drawSegN(x, style, c);
         break;
      case 7:
         drawSegA(x, style, c);
         drawSegB(x, style, c);
         drawSegC(x, style, c);
         drawSegF(x, style, c);  // Hooked 7
         drawSegI(x, style, c);
         drawSegJ(x, style, c);
         drawSegK(x, style, c);
         drawSegL(x, style, c);
         break;
      case 8:
         drawSegA(x, style, c);
         drawSegB(x, style, c);
         drawSegC(x, style, c);
         drawSegD(x, style, c);
         drawSegE(x, style, c);
         drawSegF(x, style, c);
         drawSegG(x, style, c);
         break;
      case 9:
         drawSegA(x, style, c);
         drawSegB(x, style, c);
         drawSegC(x, style, c);
         drawSegD(x, style, c);
         drawSegF(x, style, c);
         drawSegG(x, style, c);
         drawSegK(x, style, c);
         drawSegM(x, style, c);
         break;
      case 0xA:
         drawSegA(x, style, c);
         drawSegB(x, style, c);
         drawSegC(x, style, c);
         drawSegE(x, style, c);
         drawSegF(x, style, c);
         drawSegG(x, style, c);
         drawSegK(x, style, c);
         drawSegL(x, style, c);
         drawSegM(x, style, c);
         drawSegN(x, style, c);
         break;
      case 0xB:
         drawSegC(x, style, c);     // Lowercase 'b'
         drawSegD(x, style, c);
         drawSegE(x, style, c);
         drawSegF(x, style, c);
         drawSegG(x, style, c);
         if (style == LED_DOT_STYLE) {
            drawSegA(x, style, c);  // Uppercase 'B'
            drawSegB(x, style, c);
            drawSegI(x, style, c);
            drawSegM(x, style, c);
            drawSegN(x, style, c);
         }
         break;
      case 0xC:
         drawSegA(x, style, c);
         drawSegD(x, style, c);
         drawSegE(x, style, c);
         drawSegF(x, style, c);
         drawSegJ(x, style, c);
         drawSegL(x, style, c);
         drawSegN(x, style, c);
         break;
      case 0xD:
         if (style == LED_DOT_STYLE) {
            drawSegA(x, style, c);  // Uppercase 'D'
            drawSegB(x, style, c);
            drawSegC(x, style, c);
            drawSegD(x, style, c);
            drawSegE(x, style, c);
            drawSegF(x, style, c);
            drawSegI(x, style, c);
            drawSegK(x, style, c);
            drawSegM(x, style, c);
            drawSegN(x, style, c);
         }
         else {
            drawSegB(x, style, c);  // Lowercase 'd'
            drawSegC(x, style, c);
            drawSegD(x, style, c);
            drawSegE(x, style, c);
            drawSegG(x, style, c);
         }
         break;
      case 0xE:
         drawSegA(x, style, c);
         drawSegD(x, style, c);
         drawSegE(x, style, c);
         drawSegF(x, style, c);
         drawSegG(x, style, c);
         drawSegI(x, style, c);
         drawSegJ(x, style, c);
         drawSegL(x, style, c);
         drawSegM(x, style, c);
         drawSegN(x, style, c);
         break;
      case 0xF:
         drawSegA(x, style, c);
         drawSegE(x, style, c);
         drawSegF(x, style, c);
         drawSegG(x, style, c);
         drawSegI(x, style, c);
         drawSegJ(x, style, c);
         drawSegM(x, style, c);
         drawSegN(x, style, c);
         break;
      }
   }
}


/* drawBarGraph --- draw a bargraph at a given Y co-ordinate */

